#### Project 3 Part 3

- Paula Pipkin

#### Create a 'Movie' DataBase with the following tables:

- title_basics
- title_ratings
- title_genres
- genres
- tmdb_data

#### Genre tables:

In [65]:
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import json
from sqlalchemy.types import *

In [39]:
with open('/Users/paula/.secret/SQL_password.json', 'r') as f:
    login = json.load(f)
key = login['key']

In [40]:
basics = pd.read_csv('data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama

In [41]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama,[Drama]

In [42]:
#explode the item in each list in each row
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,Drama

In [43]:
#get the unique values
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [44]:
title_genre = exploded_genres[['tconst', 'genres_split']].copy()
title_genre.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [45]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [46]:
## make new integer genre_id and drop string genres
exploded_genres['genre_id'] = exploded_genres['genres_split'].map(genre_map)
exploded_genres = exploded_genres.drop(columns='genres_split')

In [47]:
genre_lookup = pd.DataFrame({"genre_name": genre_map.keys(), "genre_id":genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### other tables

In [58]:
tmdb_data = pd.read_csv("data/tmdb_results_combined.csv.gz")
tmdb_data.drop(index=0, inplace=True)
tmdb_data.head()

     imdb_id      budget     revenue certification
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG
5  tt0118852         0.0         0.0             R

In [59]:
tmdb_data.reset_index(inplace=True, drop=True)
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694    150000.0  12854953.0            PG
4  tt0118852         0.0         0.0             R

In [60]:
title_basics = pd.read_csv('data/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama

In [62]:
title_basics = title_basics.drop(columns=['originalTitle','isAdult', 'titleType', 'genres'])
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [63]:
title_ratings = pd.read_csv('data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000005            6.2      2527
3  tt0000006            5.1       173
4  tt0000007            5.4       789

In [73]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476170 entries, 0 to 476169
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         476170 non-null  object
 1   averageRating  476170 non-null  float64
 2   numVotes       476170 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 10.9+ MB

### Creating Data Base

In [71]:
connection_str = f'mysql+pymysql://root:{key}@localhost/movie'
engine = create_engine(connection_str)
if database_exists(connection_str) == False:
    create_database(connection_str)
else:
    print('database already exists')

- Defining primary keys and dtypes for columns

- title_basics

In [66]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [72]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

82476

In [74]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

- title_ratings

In [75]:
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary 
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

#crate table
title_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

476170

- tmdb data

In [77]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2497 entries, 0 to 2496
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2497 non-null   object
 1   budget         2496 non-null   float64
 2   revenue        2496 non-null   float64
 3   certification  795 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.2+ KB

In [78]:
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary 
df_schema = {
    'imdb_id': String(key_len+1), 
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

#crate table
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2497

In [82]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

- genre

In [79]:
title_genre.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 154160 entries, 0 to 82475
Data columns (total 2 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   tconst        154160 non-null  object
 1   genres_split  154160 non-null  object
dtypes: object(2)
memory usage: 3.5+ MB

In [81]:
key_len = title_genre['tconst'].fillna('').map(len).max()
genre_len = title_genre['genres_split'].fillna('').map(len).max()

## Create a schema dictonary 
df_schema = {
    'tconst': String(key_len+1), 
    'genres_split':Text(cert_len+1)}

#crate table
title_genre.to_sql('title_genre',engine,dtype=df_schema,if_exists='replace',index=False)

154160

genre_lookup.info()

In [93]:
key_len = genre_lookup['genre_name'].fillna('').map(len).max()

## Create a schema dictonary 
df_schema = {
    'genre_name': String(key_len+1), 
    'genre_id':Integer()}

#crate table
genre_lookup.set_index('genre_id').to_sql('genre',engine,dtype=df_schema,if_exists='replace',index=True)

26

#### Queries

In [94]:
q = """SHOW TABLES;"""

pd.read_sql(q,engine)

  Tables_in_movie
0           genre
1    title_basics
2     title_genre
3   title_ratings
4       tmdb_data

In [87]:
q = """SELECT * FROM title_basics LIMIT 5;"""

pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [89]:
q = """SELECT * FROM title_genre LIMIT 5;"""

pd.read_sql(q,engine)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance
3  tt0062336        Drama
4  tt0069049        Drama

In [90]:
q = """SELECT * FROM tmdb_data LIMIT 5;"""

pd.read_sql(q,engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0113026  10000000.0         0.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

In [91]:
q = """SELECT * FROM title_ratings LIMIT 5;"""

pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000005            6.2      2527
3  tt0000006            5.1       173
4  tt0000007            5.4       789

In [95]:
q = """SELECT * FROM genre LIMIT 5;"""

pd.read_sql(q,engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography